** Org-Babel setup

#+BEGIN_SRC emacs-lisp
(org-babel-do-load-languages
`org-babel-load-languages
 `((dot . t)
 (shell . t)
 (python . t)
 (ditaa . t)
 (latex . t)
 (R . t)
;;(julia . t)
(screen . t)
))

 (setq org-confirm-babel-evaluate nil)   ;don't prompt me to confirm everytime I want to evaluate a block
   ;; ;;; display/update images in the buffer after I evaluate
 (add-hook 'org-babel-after-execute-hook 'org-display-inline-images 'append)

#+END_SRC

#+RESULTS:
| org-display-inline-images |
[2019-01-08 Tue]
Async
#+begin_src emacs-lisp
(require 'ob-async)
#+end_src

#+RESULTS:
: ob-async

** Capture Templates
#+BEGIN_SRC emacs-lisp
  (setq org-capture-templates
        '(
          ("t" "Tasks")
          ("tw" "(work) Task/Idea" entry (file+headline "~/jalihal_projects/Research/LabNoteBook.org" "Tasks")
           "** TODO %?  %^g
    :PROPERTIES:
    :BLOCKER:
    :TRIGGER:
    :END:\n%u" )

          ("e" "Entry")
          ("ep" "presentation" entry (file+olp "~/jalihal_projects/Research/LabNoteBook.org" "Presentations")
           "** Meeting on %U
  ,#+BIND: org-export-use-babel nil
  ,#+STARTUP: beamer
  ,#+OPTIONS: H:1 toc:nil
  ,#+AUTHOR: Amogh Jalihal
  ,#+TITLE: Meeting on %U
  ,#+EXPORT_FILE_NAME: 
  ,#+LATEX_HEADER: \\usetheme{metropolis}
  %?" :prepend t :empty-lines 1)
          ("em" "meeting" entry (file+olp "~/jalihal_projects/Research/LabNoteBook.org" "Meeting Notes")
           "** Meeting on %U
  - %?" :prepend t :empty-lines 1)        
          ("el" "labnotebook" entry (file+datetree "~/jalihal_projects/Research/LabNoteBook.org")
           "* %?
  %U")        

        
          ;;("e" "Event" entry (file+datetree "~/orgs/diary.org")
          ;;"* IN-PROGRESS EVENT with %? :MEETING:\n%t" :clock-in t :clock-resume t)
          ("cp" "personal" entry (file+datetree "~/orgs/diary.org")
           "* %?\n%U\n" :clock-in t :clock-resume t)
          ("s" "Social" entry (file+olp "~/public_html/social.org" "Social")
           "* \n
    ,#+BEGIN_EXPORT html
    <div class=\"container\">
    ,#+END_EXPORT\n
    %U\n\n%?\n
    ,#+BEGIN_EXPORT html
    </div>
    ,#+END_EXPORT" :prepend t :empty-lines 1)
          ))
  ;; Allow creation of new parent nodes
  (setq org-refile-allow-creating-parent-nodes `confirm)
  ;; Look up to three levels deep
  (setq org-refile-targets '((org-agenda-files :maxlevel . 4)))
#+END_SRC

#+RESULTS:
: ((org-agenda-files :maxlevel . 4))

** Inline Image setting for Org-mode
#+BEGIN_SRC emacs-lisp
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Targets include this file and any file contributing to the agenda - up to 5 levels deep
(setq org-image-actual-width nil)
(setq org-toggle-inline-images t)
#+END_SRC
<2018-10-26 Fri>
Refresh inline display
#+BEGIN_SRC elisp
(add-hook 'org-babel-after-execute-hook 'org-display-inline-images)
#+END_SRC

#+RESULTS:
| org-display-inline-images |

*** Adding journal abbreviations
#+begin_src emacs-lisp
(add-to-list 'org-ref-bibtex-journal-abbreviations
  '("FEMS" "FEMS Yeast Research" "FEMS. Yeast. Res"))
#+end_src

#+RESULTS:
| FEMS     | FEMS Yeast Research                                                             | FEMS. Yeast. Res                |
| ACR      | Accounts of Chemical Research                                                   | Acc. Chem. Res.                 |
| ACAT     | ACS Catalysis                                                                   | ACS Catal.                      |
| AM       | Acta Materialia                                                                 | Acta Mater.                     |
| AMM      | Acta Metallurgica et Materialia                                                 | Acta Metall. Mater.             |
| AEM      | Advanced Energy Materials                                                       | Adv. Energy Mater.              |
| AAMI     | ACS Applied Materials \& Interfaces                                             | ACS Appl. Mater. Interfaces     |
| AMiner   | American Mineralogist                                                           | Am. Mineral.                    |
| AngC     | Angewandte Chemie-International Edition                                         | Angew. Chem. Int. Edit.         |
| APLM     | APL Materials                                                                   | APL Mat.                        |
| ACBE     | Applied Catalysis B: Environmental                                              | Appl. Catal. B-Environ.         |
| APL      | Applied Physics Letters                                                         | Appl. Phys. Lett.               |
| ASS      | Applied Surface Science                                                         | Appl. Surf. Sci.                |
| CL       | Catalysis Letters                                                               | Catal. Lett.                    |
| CC       | Catalysis Communications                                                        | Catal. Commun.                  |
| CST      | Catalysis Science & Technology                                                  | Catal. Sci. Technol.            |
| CT       | Catalysis Today                                                                 | Catal. Today                    |
| ChC      | Chemical Communications                                                         | Chem. Commun.                   |
| CPL      | Chemical Physics Letters                                                        | Chem. Phys. Lett                |
| CR       | Chemical Reviews                                                                | Chem. Rev.                      |
| CSR      | Chemical Society Reviews                                                        | Chem. Soc. Rev.                 |
| CSR      | Chemical Society Reviews                                                        | Chem. Soc. Rev.                 |
| CM       | Chemistry of Materials                                                          | Chem. Mater.                    |
| CSA      | Colloids and Surfaces, A: Physicochemical and Engineering Aspects               | Colloids Surf., A               |
| CF       | Combustion and Flame                                                            | Combust. Flame                  |
| CPMS     | Computational Materials Science                                                 | Comp. Mater. Sci.               |
| CPC      | Computer Physics Communications                                                 | Comput. Phys. Commun.           |
| CSE      | Computing in Science \& Engineering                                             | Comput. Sci. Eng.               |
| CGD      | Crystal Growth \& Design                                                        | Cryst. Growth Des.              |
| CEC      | CrystEngComm                                                                    | CrystEngComm                    |
| EA       | Electrochimica Acta                                                             | Electrochim. Acta               |
| ECST     | ECS Transactions                                                                | ECS Trans.                      |
| EES      | Energy \& Environmental Science                                                 | Energy Environ. Sci.            |
| HPR      | High Pressure Research                                                          | High Pressure Res.              |
| IC       | Inorganic Chemistry                                                             | Inorg. Chem.                    |
| IECR     | Industrial \& Engineering Chemistry Research                                    | Ind. Eng. Chem. Res.            |
| JJAP     | Japanese Journal of Applied Physics                                             | Jpn. J. Appl. Phys.             |
| JMatR    | Journal of  Materials Research                                                  | J. Mater. Res.                  |
| JALC     | Journal of Alloys and Compounds                                                 | J. Alloy Compd.                 |
| JAC      | Journal of Applied Crystallography                                              | J. Appl. Crystallogr.           |
| JAE      | Journal of Applied Electrochemistry                                             | J. Appl. Electrochem.           |
| JAP      | Journal of Applied Physics                                                      | J. Appl. Phys.                  |
| JC       | Journal of Catalysis                                                            | J. Catal.                       |
| JCP      | Journal of Chemical Physics                                                     | J. Chem. Phys.                  |
| JCC      | Journal of Computational Chemistry                                              | J. Comput. Chem.                |
| JCG      | Journal of Crystal Growth                                                       | J. Crys. Growth                 |
| JMC      | Journal of Materials Chemistry                                                  | J. Mater. Chem.                 |
| JMC      | Journal of Materials Chemistry                                                  | J. Mater. Chem.                 |
| JMSL     | Journal of Materials Science Letters                                            | J. Mater. Sci. Lett.            |
| JMS      | Journal of Membrane Science                                                     | J. Memb. Sci.                   |
| JPE      | Journal of Phase Equilibria                                                     | J. Phase Equilib.               |
| JPCS     | Journal of Physics and Chemistry of Solids                                      | J. Phys. Chem. Solids           |
| JPCM     | Journal of Physics: Condensed Matter                                            | J. Phys.: Condens. Matter       |
| JPS      | Journal of Power Sources                                                        | J. Power Sources                |
| JSSC     | Journal of Solid State Chemistry                                                | J. Solid State Chem.            |
| JACerS   | Journal of the American Ceramic Society                                         | J. Am. Ceram. Soc.              |
| JACS     | Journal of the American Chemical Society                                        | J. Am. Chem. Soc.               |
| JASIST   | Journal of the American Society for Information Science and Technology          | J. Am. Soc. Inf. Sci. Technol.  |
| JES      | Journal of The Electrochemical Society                                          | J. Electrochem. Soc.            |
| JEaC     | Journal of Electroanalytical Chemistry                                          | J. Electroanal. Chem.           |
| JMS      | Journal of Membrane Science                                                     | J. Memb. Sci.                   |
| JRS      | Journal of Raman Spectroscopy                                                   | J. Raman Spectrosc.             |
| JVST     | Journal of Vacuum Science \& Technology A                                       | J. Vac. Sci. Technol. A         |
| ML       | Materials Letters                                                               | Mater. Lett.                    |
| MSE-BS   | Materials Science and Engineering B                                             | Mat. Sci. Eng. B-Solid          |
| MOLSIM   | Molecular Simulation                                                            | Mol. Sim.                       |
| Nature   | Nature                                                                          | Nature                          |
| NM       | Nature Materials                                                                | Nat. Mater.                     |
| NC       | Nature Chemistry                                                                | Nat. Chem.                      |
| PML      | Philosophical Magazine Letters                                                  | Phil. Mag. Lett.                |
| PMA      | Philosophical Magazine A                                                        | Phil. Mag. A                    |
| PA       | Physica A: Statistical Mechanics and its Applications                           | Physica A                       |
| PB       | Physica B-Condensed Matter                                                      | Physica B                       |
| PCCP     | Physical Chemistry Chemical Physics                                             | Phys. Chem. Chem. Phys.         |
| PSSB     | physica status solidi (b)                                                       | Phys. Status Solidi B           |
| PRA      | Physical Review A                                                               | Phys. Rev. A                    |
| PRB      | Physical Review B                                                               | Phys. Rev. B                    |
| PRL      | Physical Review Letters                                                         | Phys. Rev. Lett.                |
| PCM      | Physics and Chemistry of Minerals                                               | Phys. Chem. Miner.              |
| PNAS     | Proceedings of the National Academy of Sciences of the United States of America | Proc. Natl. Acad. Sci. U. S. A. |
| PSurfSci | Progress in Surface Science                                                     | Prog. Surf. Sci.                |
| Science  | Science                                                                         | Science                         |
| SM       | Scripta Materialia                                                              | Scr. Mater.                     |
| SABC     | Sensors and Actuators B: Chemical                                               | Sensor. Actuat. B-Chem.         |
| SS       | Surface Science                                                                 | Surf. Sci.                      |
| EPJB     | The European Physical Journal B                                                 | Eur. Phys. J. B                 |
| JPC      | The Journal of Physical Chemistry                                               | J. Phys. Chem.                  |
| JPCB     | The Journal of Physical Chemistry B                                             | J. Phys. Chem. B                |
| JPCC     | The Journal of Physical Chemistry C                                             | J. Phys. Chem. C                |
| JPCL     | The Journal of Physical Chemistry Letters                                       | J. Phys. Chem. Lett.            |
| JCP      | The Journal of Chemical Physics                                                 | J. Chem. Phys.                  |
| MSMSE    | Modelling and Simulation in Materials Science and Engineering                   | Modell. Simul. Mater. Sci. Eng. |
| TSF      | Thin Solid Films                                                                | Thin Solid Films                |
| TC       | Topics in Catalysis                                                             | Top. Catal.                     |
| WR       | Water Research                                                                  | Water Res.                      |

** Ox-latex
#+BEGIN_SRC emacs-lisp
(require 'ox-latex)
;;(setq org-latex-listings 'minted)
;;(add-to-list 'org-latex-minted-langs '(ipython "python"))
#+END_SRC
[2019-01-03 Thu]
From John Kitchin’s blog
#+begin_src emacs-lisp
  (org-add-link-type
   "comment"
   (lambda (linkstring)
     (let ((elm (org-element-context))
           (use-dialog-box nil))
       (when (y-or-n-p "Delete comment? ")
         (setf (buffer-substring
                (org-element-property :begin elm)
                (org-element-property :end elm))
               (cond
                ((org-element-property :contents-begin elm)
                 (buffer-substring
                  (org-element-property :contents-begin elm)
                  (org-element-property :contents-end elm)))
                (t
                 ""))))))
   (lambda (keyword desc format)
     (cond
      ((eq format 'html)
       (format "<font color=\"red\"><abbr title=\"%s\" color=\"red\">COMMENT</abbr></font> %s" keyword (or desc "")))
      ((eq format 'latex)
      ;; AJ: Ignore the description, format the link part inline
      (format "%% %s\n" keyword)))))
#+end_src

#+RESULTS:
: Created comment link.

** Better Ediff for org-mode
<2018-10-26 Fri>
From [[https://emacs.stackexchange.com/questions/21335/prevent-folding-org-files-opened-by-ediff][here]]
#+BEGIN_SRC elisp
;; Check for org mode and existence of buffer
(defun f-ediff-org-showhide (buf command &rest cmdargs)
  "If buffer exists and is orgmode then execute command"
  (when buf
    (when (eq (buffer-local-value 'major-mode (get-buffer buf)) 'org-mode)
      (save-excursion (set-buffer buf) (apply command cmdargs)))))

(defun f-ediff-org-unfold-tree-element ()
  "Unfold tree at diff location"
  (f-ediff-org-showhide ediff-buffer-A 'org-reveal)  
  (f-ediff-org-showhide ediff-buffer-B 'org-reveal)  
  (f-ediff-org-showhide ediff-buffer-C 'org-reveal))

(defun f-ediff-org-fold-tree ()
  "Fold tree back to top level"
  (f-ediff-org-showhide ediff-buffer-A 'hide-sublevels 1)  
  (f-ediff-org-showhide ediff-buffer-B 'hide-sublevels 1)  
  (f-ediff-org-showhide ediff-buffer-C 'hide-sublevels 1))

(add-hook 'ediff-select-hook 'f-ediff-org-unfold-tree-element)
(add-hook 'ediff-unselect-hook 'f-ediff-org-fold-tree)
#+END_SRC

#+RESULTS:
| f-ediff-org-fold-tree |

*** Latex
#+BEGIN_SRC emacs-lisp
(require 'ac-math) 
(add-to-list 'ac-modes 'latex-mode)   ; make auto-complete aware of `latex-mode`

 (defun ac-LaTeX-mode-setup () ; add ac-sources to default ac-sources
   (setq ac-sources
         (append '(ac-source-math-unicode ac-source-math-latex ac-source-latex-commands)
                 ac-sources))
   )
(add-hook 'LaTeX-mode-hook 'ac-LaTeX-mode-setup)
;(global-auto-complete-mode t)
 
(setq ac-math-unicode-in-math-p t)
(setq ac-math-unicode-in-math-p t)
#+END_SRC
[2019-01-07 Mon]
#+begin_src emacs-lisp
(setq org-latex-pdf-process
(quote ("pdflatex -shell-escape -interaction nonstopmode %f" "bibtex %b" "bibtex %b" "pdflatex -shell-escape -interaction nonstopmode %f" "pdflatex -shell-escape -interaction nonstopmode %f")))
#+end_src

#+RESULTS:
| pdflatex -shell-escape -interaction nonstopmode %f | bibtex %b | bibtex %b | pdflatex -shell-escape -interaction nonstopmode %f | pdflatex -shell-escape -interaction nonstopmode %f |

** Syntax Highlighting for code Export
#+BEGIN_SRC emacs-lisp
;; Add minted to the defaults packages to include when exporting.
(add-to-list 'org-latex-packages-alist '("" "minted"))
;; Tell the latex export to use the minted package for source
;; code coloration.
 (setq org-latex-listings 'minted)
;; Let the exporter use the -shell-escape option to let latex
;; execute external programs.
;; This obviously and can be dangerous to activate!
;; When using minted, use this:
 (setq org-latex-pdf-process
 (quote ("pdflatex -shell-escape -interaction nonstopmode %f" "bibtex %b" "bibtex %b" "pdflatex -shell-escape -interaction nonstopmode %f" "pdflatex -shell-escape -interaction nonstopmode %f")))
#+END_SRC

#+RESULTS:
| pdflatex -shell-escape -interaction nonstopmode %f | bibtex %b | bibtex %b | pdflatex -shell-escape -interaction nonstopmode %f | pdflatex -shell-escape -interaction nonstopmode %f |

** PDFLATEX command execution order in org mode export
#+BEGIN_SRC emacs-lisp
(setq org-latex-pdf-process
 (quote ("pdflatex  --shell-escape %f" "bibtex %b" "bibtex %b" "pdflatex  %f" "pdflatex %f")))
#+END_SRC

#+RESULTS:
| pdflatex  --shell-escape %f | bibtex %b | bibtex %b | pdflatex  %f | pdflatex %f |

** Auctex latex export style
[2019-01-28 Mon]
#+begin_src emacs-lisp
(setq LaTeX-command-style '(("" "%(PDF)%(latex) %(file-line-error) %(extraopts) -shell-escape %S%(PDFout)")))
#+end_src

#+RESULTS:
|   | %(PDF)%(latex) %(file-line-error) %(extraopts) -shell-escape %S%(PDFout) |
** Synctex
[2019-01-28 Mon]
#+begin_src emacs-lisp

   (setq TeX-source-correlate-method (quote synctex))
   (setq TeX-source-correlate-mode t)
   (setq TeX-source-correlate-start-server t)
   (setq TeX-view-program-list (quote (("Okular" "okular --unique %o#src:%n%b"))))
   ;;(setq TeX-view-program-selection (quote ((engine-omega "dvips and gv") (output-dvi "xdvi") (output-pdf "Okular") (output-html "xdg-open")))))
#+end_src

#+RESULTS:
| Okular | okular --unique %o#src:%n%b |

** My customizations
[2019-01-28 Mon]
#+begin_src emacs-lisp


   (setq TeX-auto-save t)
   (setq TeX-parse-self t)
   (setq-default TeX-master nil)

   (require 'reftex)
   (add-hook 'LaTeX-mode-hook 'turn-on-reftex)   ; with AUCTeX LaTeX mode

    (add-to-list 'load-path "~/.emacs.d/lisp/")
   (require 'company-auctex)
  (company-auctex-init)
#+end_src

#+RESULTS:
| (company-auctex-macros company-auctex-symbols company-auctex-environments) | company-auctex-bibs | company-auctex-labels | company-bbdb | company-nxml | company-css | company-eclim | company-semantic | company-clang | company-xcode | company-cmake | company-capf | company-files | (company-dabbrev-code company-gtags company-etags company-keywords) | company-oddmuse | company-dabbrev |

